v1 dockerized application ready.
